# Taps
tap "homebrew/services"
tap "mongodb/brew"

# Data & Infra Services & Tools
cask "docker"
cask "lens"
brew "minikube"
brew "mongodb/brew/mongodb-community"
brew "postgresql@15"
brew "redis"

# Programming Languages
brew "go"
cask "mambaforge"
cask "powershell"
cask "temurin"

# Dev Tools
cask "codewhisperer"
cask "github"
cask "iterm2"
cask "jetbrains-toolbox"
cask "insomnia"
cask "visual-studio-code"

# Design Tools
cask "figma"
cask "drawio"

# CLI Tools
brew "azure-cli"
brew "awscli"
brew "gh"
brew "tree"
brew "jq"
cask "google-cloud-sdk"

# Utility Apps
cask "bartender"
cask "hazeover"
cask "keka"
cask "obsidian"
cask "spotify"
cask "tiles"
cask "whisky"
